---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctInsulationType
source: html/1b5fbe94-ee41-c9fb-0b8a-f776f8d443fb.htm
---
# DuctInsulationType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.